       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-PROG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-OUTER-FLAG            PIC 9 VALUE 0.

       PROCEDURE DIVISION.
       OUTER-MAIN.
           PERFORM OUTER-PROCESS
           CALL "INNER-PROG"
           STOP RUN.

       OUTER-PROCESS.
           DISPLAY 'OUTER PROCESSING'.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-PROG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INNER-CODE            PIC X(5).

       PROCEDURE DIVISION.
       INNER-MAIN.
           PERFORM INNER-PROCESS
           GOBACK.

       INNER-PROCESS.
           DISPLAY 'INNER PROCESSING'.

       END PROGRAM INNER-PROG.
       END PROGRAM OUTER-PROG.
